// DO-NOT-REMOVE begin-copyright-block 
//                                     
// Redistributions of any form whatsoever must retain and/or include the     
// following acknowledgment, notices and disclaimer:                         
//                                                                           
// This product includes software developed by Carnegie Mellon University.   
//                                                                           
// Copyright 2006 - 2008 by Eric Chung, Michael Ferdman, Brian Gold, Nikos   
// Hardavellas, Jangwoo Kim, Ippokratis Pandis, Minglong Shao, Jared Smolens,
// Stephen Somogyi, Evangelos Vlachos, Tom Wenisch, Anastassia Ailamaki,     
// Babak Falsafi and James C. Hoe for the SimFlex Project, Computer          
// Architecture Lab at Carnegie Mellon, Carnegie Mellon University.          
//                                                                           
// For more information, see the SimFlex project website at:                 
//   http://www.ece.cmu.edu/~simflex                                         
//                                                                           
// You may not use the name 'Carnegie Mellon University' or derivations      
// thereof to endorse or promote products derived from this software.        
//                                                                           
// If you modify the software you must place a notice on or within any       
// modified version provided or made available to any third party stating    
// that you have modified the software.  The notice shall include at least   
// your name, address, phone number, email address and the date and purpose  
// of the modification.                                                      
//                                                                           
// THE SOFTWARE IS PROVIDED 'AS-IS' WITHOUT ANY WARRANTY OF ANY KIND, EITHER 
// EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO ANY WARRANTY  
// THAT THE SOFTWARE WILL CONFORM TO SPECIFICATIONS OR BE ERROR-FREE AND ANY 
// IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,  
// TITLE, OR NON-INFRINGEMENT.  IN NO EVENT SHALL CARNEGIE MELLON UNIVERSITY 
// BE LIABLE FOR ANY DAMAGES, INCLUDING BUT NOT LIMITED TO DIRECT, INDIRECT, 
// SPECIAL OR CONSEQUENTIAL DAMAGES, ARISING OUT OF, RESULTING FROM, OR IN   
// ANY WAY CONNECTED WITH THIS SOFTWARE (WHETHER OR NOT BASED UPON WARRANTY, 
// CONTRACT, TORT OR OTHERWISE).                                             
//                                     
// DO-NOT-REMOVE end-copyright-block   


#include <list>
#include <iostream>
#include <iomanip>
#include <algorithm>
#include <vector>

#include <core/boost_extensions/intrusive_ptr.hpp>
#include <boost/throw_exception.hpp>
#include <boost/shared_ptr.hpp>
#include <core/metaprogram.hpp>
#include <boost/variant/get.hpp>
#include <boost/optional.hpp>
#include <boost/none.hpp>
#include <boost/iterator/reverse_iterator.hpp>

#include <boost/multi_index_container.hpp>
#include <boost/multi_index/identity.hpp>
#include <boost/multi_index/member.hpp>
#include <boost/multi_index/ordered_index.hpp>
#include <boost/multi_index/sequenced_index.hpp>
#include <boost/multi_index/composite_key.hpp>
using namespace boost::multi_index;
#include <core/target.hpp>
#include <core/debug/debug.hpp>
#include <core/types.hpp>
#include <core/performance/profile.hpp>
#include <core/flexus.hpp>

#include <core/stats.hpp>
namespace Stat = Flexus::Stat;

#include "../coreModel.hpp"
#include "../MapTable.hpp"
#include "../RegisterFile.hpp"
#include "../BypassNetwork.hpp"
#include "coreModelTypes.hpp"
#include <components/Common/XactTimeBreakdown.hpp>
#include <components/Common/Slices/PredictorMessage.hpp> /* CMU-ONLY */
#include "bbv.hpp" /* CMU-ONLY */



namespace nuArch {


using nXactTimeBreakdown::TimeBreakdown;

class CoreImpl : public CoreModel {
  //CORE STATE
  //==========================================================================
    //Simulation
      std::string theName;
      unsigned int theNode;
      boost::function< void (Flexus::Simics::Translation &, bool) > translate;
      boost::function<int(bool)> advance_fn;
      boost::function< void(eSquashCause)> squash_fn;
      boost::function< void(VirtualMemoryAddress, VirtualMemoryAddress)> redirect_fn;
      boost::function< void(int, int)> change_mode_fn;
      boost::function< void( boost::intrusive_ptr<BranchFeedback> )> feedback_fn;
      boost::function< void (PredictorMessage::tPredictorMessageType, PhysicalMemoryAddress, boost::intrusive_ptr<TransactionTracker> ) > notifyTMS_fn; /* CMU-ONLY */
      boost::function< void( bool )> signalStoreForwardingHit_fn;

    //Map Tables
      RegisterWindowMap theWindowMap;
      std::vector< boost::shared_ptr<PhysicalMap> > theMapTables;

      RegisterWindowMap theArchitecturalWindowMap;

    //Register Files
      RegisterFile theRegisters;
      int theRoundingMode;
      unsigned long long theTPC[5];      //0
      unsigned long long theTNPC[5];     //1
      unsigned long long theTSTATE[5];   //2
      unsigned int theTT[5];       //3
      //TICK                        //4
      unsigned long long theTBA;         //5
      unsigned long long thePSTATE;      //6
      unsigned int theTL;          //7
      unsigned int thePIL;         //8
      //CWP                        //9
      unsigned int theCANSAVE;     //10
      unsigned int theCANRESTORE;  //11
      unsigned int theCLEANWIN;    //12
      unsigned int theOTHERWIN;    //13
      unsigned int theWSTATE;      //14
      unsigned long long theVER;         //31

      unsigned long long theFPRS;         //6
      unsigned long long theFSR;          //37

      unsigned long long theTICK;         //39
      unsigned long long theSTICK;        //43
      long long theSTICK_interval; //Number of cycles between STICK updates
      long long theSTICK_tillIncrement; //Number of cycles remaining till next STICK increment

      unsigned long long thePC;
      boost::optional<unsigned long long> theNPC;

      unsigned int thePendingTrap;
      bool thePopTLRequested;
      boost::intrusive_ptr<Instruction> theTrapInstruction;

    //Bypass Network
      BypassNetwork theBypassNetwork;

      unsigned long long  theLastGarbageCollect;


    //Semantic Action & Effect Management
      action_list_t theActiveActions;
      action_list_t theRescheduledActions;

      std::list< boost::intrusive_ptr< Interaction > > theDispatchInteractions;
      bool thePreserveInteractions;

    //Resource arbitration
      MemoryPortArbiter theMemoryPortArbiter;

    //Reorder Buffer
      rob_t theROB;
      int theROBSize;

    //Speculative Retirement Buffer
      rob_t theSRB;

    //Retirement
